#+BEGIN_COMMENT
.. title: Minimum Spanning Trees: Kruskal's Algorithm
.. slug: minimum-spanning-trees-kruskals-algorithm
.. date: 2022-04-27 15:30:44 UTC-07:00
.. tags: graphs,minimum spanning trees,trees,algorithms,data structures
.. category: Graphs
.. link: 
.. description: A look at Kruskal's Algorithm to find the Minimum Spanning Tree of a Graph.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-6b427dab-7063-4c13-ae3b-bfd86fb157c1-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
* Try It Out

#+begin_src python :results output :exports both
nodes = dict()

for identifier in "abcdefghi":
    nodes[identifier] = Vertex(identifier)
graph = Graph()
graph.add_edge(nodes["a"], nodes["b"], 4)
graph.add_edge(nodes["a"], nodes["h"], 8)
graph.add_edge(nodes["b"], nodes["h"], 11)
graph.add_edge(nodes["b"], nodes["c"], 8)
graph.add_edge(nodes["c"], nodes["d"], 7)
graph.add_edge(nodes["c"], nodes["i"], 2)
graph.add_edge(nodes["c"], nodes["f"], 4)
graph.add_edge(nodes["d"], nodes["e"], 9)
graph.add_edge(nodes["d"], nodes["f"], 14)
graph.add_edge(nodes["e"], nodes["f"], 10)
graph.add_edge(nodes["f"], nodes["g"], 2)
graph.add_edge(nodes["g"], nodes["h"], 1)
graph.add_edge(nodes["g"], nodes["i"], 6)
graph.add_edge(nodes["h"], nodes["i"], 7)

Disjoint.make_sets(graph.vertices)

expect(graph.vertices).to(contain_only(*nodes.values()))

for node in nodes.values():
    expect(node.parent).to(be(node))
    expect(node.rank).to(equal(0))

tree = kruskal(graph)
pprint(tree)
#+end_src

#+RESULTS:
: {a --4-- b,
:  a --8-- h,
:  c --7-- d,
:  c --2-- i,
:  c --4-- f,
:  d --9-- e,
:  f --2-- g,
:  g --1-- h}

**Note:** I originally thought I could check the tree structure, but the disjoint-set methods use Path Compression, so all the nodes end up having the same parent (in this case node "h").
